package javaexp.z01_homework;

public class A10_0908 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		/*
		 2022-09-08
[1단계:개념] 1. 메서드의 기본 구성요소들의 특징을 기본예제를 통해 기술하세요.
[1단계:개념] 2. 생성자의 메서드를 통한 필드값 저장의 차이점을 예제를 통해서 기술하세요.
[1단계:코드] 3. Counter 클래스를 만들고, 생성자를 통해 시작, 마지막변수를 입력하고,  메서드를 통해서 해담 범위 내용 출력하고, 누적합을 리턴 처리하게 하세요.
[1단계:코드] 4. Car 클래스의 필드 차종,색상,현재속도를 선언하고, 이 중 생성자를 통한 초기값 설정과 메서드를 통한 설정을 분리하여
             생성자, 메서드(속도증가,속도감소,현재속도확인)를 구현하여 처리하세요.
[1단계:코드] 5. 1차원 배열로 회원의 이름 5명을 선언하고 할당 출력하세요
              2차원 배열로 위 회원이름에 추가하여 나이와 사는 곳을 만들어 할당하고 출력하세요
[1단계:개념] 6. 패키지란 무엇이면, 외부패키지의 클래스를 객체로 사용할 때 전제조건과 방법 2가지를 기술하세요.
		 */

	}

}
